micronaut/.results/latency-graalvm.txt
Running 3m test @ http://localhost:8101/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 6.589ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.578ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.624ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.597ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.571ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.56ms    3.32ms 127.30ms   92.17%
    Req/Sec   205.50     44.10   764.00     82.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.78ms
 75.000%    6.58ms
 90.000%    8.82ms
 99.000%   18.25ms
 99.900%   42.21ms
 99.990%   94.21ms
 99.999%  115.26ms
100.000%  127.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.601     0.000000            1         1.00
       4.759     0.100000        17031         1.11
       5.083     0.200000        33981         1.25
       5.331     0.300000        51127         1.43
       5.559     0.400000        68170         1.67
       5.783     0.500000        84962         2.00
       5.907     0.550000        93563         2.22
       6.039     0.600000       102137         2.50
       6.187     0.650000       110493         2.86
       6.363     0.700000       119042         3.33
       6.579     0.750000       127487         4.00
       6.715     0.775000       131682         4.44
       6.883     0.800000       135981         5.00
       7.099     0.825000       140187         5.71
       7.411     0.850000       144436         6.67
       7.923     0.875000       148692         8.00
       8.319     0.887500       150802         8.89
       8.823     0.900000       152929        10.00
       9.391     0.912500       155049        11.43
      10.055     0.925000       157167        13.33
      10.863     0.937500       159294        16.00
      11.351     0.943750       160346        17.78
      11.943     0.950000       161411        20.00
      12.607     0.956250       162480        22.86
      13.343     0.962500       163538        26.67
      14.183     0.968750       164592        32.00
      14.711     0.971875       165128        35.56
      15.247     0.975000       165655        40.00
      15.783     0.978125       166184        45.71
      16.335     0.981250       166717        53.33
      16.943     0.984375       167253        64.00
      17.215     0.985938       167519        71.11
      17.567     0.987500       167781        80.00
      17.951     0.989062       168052        91.43
      18.447     0.990625       168308       106.67
      19.215     0.992188       168577       128.00
      19.759     0.992969       168704       142.22
      20.527     0.993750       168837       160.00
      21.407     0.994531       168970       182.86
      22.447     0.995313       169104       213.33
      23.615     0.996094       169235       256.00
      24.607     0.996484       169301       284.44
      25.519     0.996875       169368       320.00
      26.511     0.997266       169434       365.71
      27.967     0.997656       169501       426.67
      30.111     0.998047       169567       512.00
      32.207     0.998242       169600       568.89
      34.303     0.998437       169633       640.00
      36.991     0.998633       169666       731.43
      39.679     0.998828       169700       853.33
      42.783     0.999023       169733      1024.00
      44.447     0.999121       169749      1137.78
      46.239     0.999219       169766      1280.00
      48.575     0.999316       169782      1462.86
      51.583     0.999414       169799      1706.67
      55.455     0.999512       169816      2048.00
      56.447     0.999561       169824      2275.56
      59.647     0.999609       169832      2560.00
      65.247     0.999658       169840      2925.71
      72.639     0.999707       169849      3413.33
      77.311     0.999756       169857      4096.00
      78.719     0.999780       169861      4551.11
      81.087     0.999805       169865      5120.00
      82.111     0.999829       169869      5851.43
      85.119     0.999854       169874      6826.67
      89.727     0.999878       169878      8192.00
      92.223     0.999890       169880      9102.22
      94.271     0.999902       169882     10240.00
      96.959     0.999915       169884     11702.86
      99.711     0.999927       169886     13653.33
     101.823     0.999939       169888     16384.00
     105.471     0.999945       169889     18204.44
     106.559     0.999951       169890     20480.00
     109.183     0.999957       169891     23405.71
     109.311     0.999963       169892     27306.67
     110.591     0.999969       169893     32768.00
     112.255     0.999973       169894     36408.89
     112.255     0.999976       169894     40960.00
     113.343     0.999979       169895     46811.43
     113.343     0.999982       169895     54613.33
     115.263     0.999985       169896     65536.00
     115.263     0.999986       169896     72817.78
     115.263     0.999988       169896     81920.00
     121.087     0.999989       169897     93622.86
     121.087     0.999991       169897    109226.67
     121.087     0.999992       169897    131072.00
     121.087     0.999993       169897    145635.56
     121.087     0.999994       169897    163840.00
     127.359     0.999995       169898    187245.71
     127.359     1.000000       169898          inf
#[Mean    =        6.556, StdDeviation   =        3.318]
#[Max     =      127.296, Total count    =       169898]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180000 requests in 3.00m, 65.57MB read
Requests/sec:    999.99
Transfer/sec:    373.04KB