micronaut/.results/latency-jvm.txt
Running 3m test @ http://localhost:8101/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 6.611ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.629ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.684ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.570ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.750ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.09ms    2.27ms  36.32ms   89.99%
    Req/Sec   204.96     36.25   428.00     71.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.55ms
 75.000%    6.33ms
 90.000%    7.88ms
 99.000%   16.18ms
 99.900%   23.60ms
 99.990%   31.21ms
 99.999%   34.91ms
100.000%   36.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.537     0.000000            1         1.00
       4.479     0.100000        17116         1.11
       4.815     0.200000        34103         1.25
       5.079     0.300000        51197         1.43
       5.315     0.400000        68217         1.67
       5.551     0.500000        85053         2.00
       5.679     0.550000        93707         2.22
       5.811     0.600000       101972         2.50
       5.959     0.650000       110585         2.86
       6.127     0.700000       118951         3.33
       6.331     0.750000       127456         4.00
       6.451     0.775000       131692         4.44
       6.595     0.800000       135967         5.00
       6.771     0.825000       140196         5.71
       7.011     0.850000       144470         6.67
       7.343     0.875000       148665         8.00
       7.579     0.887500       150799         8.89
       7.883     0.900000       152928        10.00
       8.303     0.912500       155061        11.43
       8.839     0.925000       157164        13.33
       9.575     0.937500       159301        16.00
      10.007     0.943750       160345        17.78
      10.503     0.950000       161409        20.00
      11.111     0.956250       162475        22.86
      11.711     0.962500       163541        26.67
      12.423     0.968750       164599        32.00
      12.807     0.971875       165129        35.56
      13.215     0.975000       165659        40.00
      13.679     0.978125       166184        45.71
      14.183     0.981250       166715        53.33
      14.767     0.984375       167251        64.00
      15.087     0.985938       167517        71.11
      15.487     0.987500       167782        80.00
      15.919     0.989062       168047        91.43
      16.367     0.990625       168309       106.67
      16.895     0.992188       168579       128.00
      17.167     0.992969       168708       142.22
      17.519     0.993750       168842       160.00
      17.919     0.994531       168973       182.86
      18.351     0.995313       169105       213.33
      18.927     0.996094       169237       256.00
      19.343     0.996484       169307       284.44
      19.663     0.996875       169370       320.00
      20.063     0.997266       169437       365.71
      20.511     0.997656       169503       426.67
      21.279     0.998047       169569       512.00
      21.679     0.998242       169603       568.89
      22.191     0.998437       169637       640.00
      22.671     0.998633       169668       731.43
      23.215     0.998828       169701       853.33
      23.663     0.999023       169735      1024.00
      23.983     0.999121       169751      1137.78
      24.239     0.999219       169768      1280.00
      24.591     0.999316       169784      1462.86
      25.199     0.999414       169801      1706.67
      25.743     0.999512       169818      2048.00
      26.303     0.999561       169826      2275.56
      26.607     0.999609       169834      2560.00
      26.879     0.999658       169842      2925.71
      27.423     0.999707       169851      3413.33
      28.047     0.999756       169859      4096.00
      28.335     0.999780       169863      4551.11
      28.511     0.999805       169867      5120.00
      28.927     0.999829       169871      5851.43
      29.151     0.999854       169876      6826.67
      30.095     0.999878       169880      8192.00
      31.167     0.999890       169882      9102.22
      31.663     0.999902       169884     10240.00
      31.967     0.999915       169886     11702.86
      32.239     0.999927       169888     13653.33
      32.463     0.999939       169890     16384.00
      32.495     0.999945       169891     18204.44
      33.183     0.999951       169892     20480.00
      33.599     0.999957       169893     23405.71
      33.759     0.999963       169894     27306.67
      34.015     0.999969       169895     32768.00
      34.207     0.999973       169896     36408.89
      34.207     0.999976       169896     40960.00
      34.399     0.999979       169897     46811.43
      34.399     0.999982       169897     54613.33
      34.911     0.999985       169898     65536.00
      34.911     0.999986       169898     72817.78
      34.911     0.999988       169898     81920.00
      35.135     0.999989       169899     93622.86
      35.135     0.999991       169899    109226.67
      35.135     0.999992       169899    131072.00
      35.135     0.999993       169899    145635.56
      35.135     0.999994       169899    163840.00
      36.351     0.999995       169900    187245.71
      36.351     1.000000       169900          inf
#[Mean    =        6.095, StdDeviation   =        2.269]
#[Max     =       36.320, Total count    =       169900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180000 requests in 3.00m, 65.57MB read
Requests/sec:    999.99
Transfer/sec:    373.04KB